In [1]:
pip install boto3 pandas lxml

Requirement already satisfied: boto3 in c:\users\gagan\appdata\local\programs\python\python312\lib\site-packages (1.34.155)
Requirement already satisfied: pandas in c:\users\gagan\appdata\local\programs\python\python312\lib\site-packages (2.2.2)
Requirement already satisfied: lxml in c:\users\gagan\appdata\local\programs\python\python312\lib\site-packages (5.3.0)
Requirement already satisfied: botocore<1.35.0,>=1.34.155 in c:\users\gagan\appdata\local\programs\python\python312\lib\site-packages (from boto3) (1.34.155)
Requirement already satisfied: jmespath<2.0.0,>=0.7.1 in c:\users\gagan\appdata\local\programs\python\python312\lib\site-packages (from boto3) (1.0.1)
Requirement already satisfied: s3transfer<0.11.0,>=0.10.0 in c:\users\gagan\appdata\local\programs\python\python312\lib\site-packages (from boto3) (0.10.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\gagan\appdata\local\programs\python\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\gagan\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\gagan\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\gagan\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: urllib3!=2.2.0,<3,>=1.25.4 in c:\users\gagan\appdata\local\programs\python\python312\lib\site-packages (from botocore<1.35.0,>=1.34.155->boto3) (2.2.1)
Requirement already satisfied: six>=1.5 in c:\users\gagan\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.2 -> 24.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import boto3
import pandas as pd
from io import StringIO
import json
import xml.etree.ElementTree as ET

In [3]:
s3_client = boto3.client(
    's3', region_name='us-east-1',
    aws_access_key_id='AKIA5FTY6LYYWQM7BAFZ',
    aws_secret_access_key='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'
)

In [4]:
def read_from_s3(bucket_name, s3_key):
    
    response = s3_client.get_object(Bucket=bucket_name, Key=s3_key)
    
    # Read the object content as a string (CSV)
    csv_content = response['Body'].read().decode('utf-8')

    # Use StringIO to treat the CSV content as a file object and load it into pandas
    data = pd.read_csv(StringIO(csv_content))
    
    return data

In [5]:
bucket_name = 'project4etl'
s3_key = 'data/source1.csv'

In [6]:
df = read_from_s3(bucket_name, s3_key)

In [7]:
df

    name  height  weight
0   alex   65.78  112.99
1   ajay   71.52  136.49
2  alice   69.40  153.03
3   ravi   68.22  142.34
4    joe   67.79  144.30

In [8]:
df1 = df.copy()

In [9]:
df1['height'] = df1['height'] * 0.0254
df1['weight'] = df1['weight'] * 0.453592

In [10]:
df1

    name    height     weight
0   alex  1.670812  51.251360
1   ajay  1.816608  61.910772
2  alice  1.762760  69.413184
3   ravi  1.732788  64.564285
4    joe  1.721866  65.453326

In [11]:
def read_from_s3_json(bucket_name, s3_key):
    
    response = s3_client.get_object(Bucket=bucket_name, Key=s3_key)
    
    # Read the object content as a string
    json_content = response['Body'].read().decode('utf-8')

    # Use read_json with lines=True for JSON lines format
    data = pd.read_json(StringIO(json_content), lines=True)
    
    return data

In [12]:
bucket_name = 'project4etl'
s3_key = 'data/source1.json'

In [13]:
df_json2 = read_from_s3_json(bucket_name, s3_key)

In [14]:
df_json2

    name  height  weight
0   jack   68.70  123.30
1    tom   69.80  141.49
2  tracy   70.01  136.46
3   john   67.90  112.37

In [15]:
df2 = df_json2.copy()

In [16]:
df2['height'] = df2['height'] * 0.0254
df2['weight'] = df2['weight'] * 0.453592
df2

    name    height     weight
0   jack  1.744980  55.927894
1    tom  1.772920  64.178732
2  tracy  1.778254  61.897164
3   john  1.724660  50.970133

In [17]:
def read_from_s3_xml(bucket_name, s3_key):
    # Fetch the object from S3
    response = s3_client.get_object(Bucket=bucket_name, Key=s3_key)
    
    # Read the object content as a string
    xml_content = response['Body'].read().decode('utf-8')

    # Parse the XML content into a pandas DataFrame
    # Assuming the XML has a structure that can be parsed by pandas
    data = pd.read_xml(StringIO(xml_content))
    
    return data

In [18]:
bucket_name = 'project4etl'
s3_key = 'data/source1.xml'

In [19]:
df_xml = read_from_s3_xml(bucket_name, s3_key)

In [20]:
df_xml

    name  height  weight
0  simon   67.90  112.37
1  jacob   66.78  120.67
2  cindy   66.49  127.45
3   ivan   67.62  114.14

In [21]:
df3 = df_xml.copy()

In [22]:
df3['height'] = df3['height'] * 0.0254
df3['weight'] = df3['weight'] * 0.453592
df3

    name    height     weight
0  simon  1.724660  50.970133
1  jacob  1.696212  54.734947
2  cindy  1.688846  57.810300
3   ivan  1.717548  51.772991

In [23]:
data_final = pd.concat([df1,df1,df3], ignore_index = True)

In [25]:
data_final

     name    height     weight
0    alex  1.670812  51.251360
1    ajay  1.816608  61.910772
2   alice  1.762760  69.413184
3    ravi  1.732788  64.564285
4     joe  1.721866  65.453326
5    alex  1.670812  51.251360
6    ajay  1.816608  61.910772
7   alice  1.762760  69.413184
8    ravi  1.732788  64.564285
9     joe  1.721866  65.453326
10  simon  1.724660  50.970133
11  jacob  1.696212  54.734947
12  cindy  1.688846  57.810300
13   ivan  1.717548  51.772991

In [26]:
# Save the combined DataFrame to a single CSV file
data_final.to_csv('transformed_data.csv', index=False)

In [50]:
# loading transformed data into new s3 bucket

In [27]:
new_bucket_name = 'etlfinal4'  # Replace with the name of your new S3 bucket
local_file = 'transformed_data.csv'
s3_key = 'transformed_data.csv'

In [28]:
with open(local_file, 'rb') as f:
    s3_client.upload_fileobj(f, new_bucket_name, s3_key)

print(f"{local_file} uploaded to s3://{new_bucket_name}/{s3_key}")

transformed_data.csv uploaded to s3://etlfinal4/transformed_data.csv

In [55]:
# loading transformed data into RDS

In [29]:
!pip install SQLAlchemy pymysql

Requirement already satisfied: SQLAlchemy in c:\users\gagan\appdata\local\programs\python\python312\lib\site-packages (1.4.52)
Requirement already satisfied: pymysql in c:\users\gagan\appdata\local\programs\python\python312\lib\site-packages (1.1.1)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\gagan\appdata\local\programs\python\python312\lib\site-packages (from SQLAlchemy) (3.0.3)

[notice] A new release of pip is available: 24.2 -> 24.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [30]:
from sqlalchemy import create_engine

# Database credentials and connection information
db_user = 'admin'       # RDS database username
db_password = 'Gaganch007'   # RDS database password
db_host = 'project-4.ch6iy2q8mb95.us-east-1.rds.amazonaws.com'    # RDS endpoint
db_port = '3306'                # RDS port, default is 3306 for MySQL
db_name = 'TEST'  # Name of your RDS database

# Create the connection string for the RDS instance
connection_string = f"mysql+pymysql://{db_user}:{db_password}@{db_host}:{db_port}/{db_name}"

# Create the SQLAlchemy engine
engine = create_engine(connection_string)

# Test the connection
try:
    with engine.connect() as connection:
        # If connection is successful, print message
        print("Connection to the database was successful!")
except Exception as e:
    print("Error connecting to the database:", e)

Connection to the database was successful!

In [32]:
import mysql.connector
import pandas as pd

# Database credentials and connection information
db_user = 'admin'            # RDS database username
db_password = 'Gaganch007'    # RDS database password
db_host = 'project-4.ch6iy2q8mb95.us-east-1.rds.amazonaws.com'  # RDS endpoint
db_port = '3306'              # RDS port, default is 3306 for MySQL
db_name = 'TEST'              # Name of your RDS database

# Establish a connection to the database
connection = mysql.connector.connect(
    user=db_user,
    password=db_password,
    host=db_host,
    port=db_port,
    database=db_name
)

# Check if the connection was successful
if connection.is_connected():
    print("Connected to the database successfully!")
else:
    print("Failed to connect to the database.")

# Load the CSV data into a DataFrame
df = pd.read_csv('transformed_data.csv')

# Create a cursor object using the connection
cursor = connection.cursor()

# Define the table where data will be inserted
table_name = 'etl4'

# SQL query to create the table if it doesn't exist
create_table_query = f"""
CREATE TABLE IF NOT EXISTS {table_name} (
    name VARCHAR(50),
    height FLOAT,
    weight FLOAT
)
"""

# Execute the table creation query
cursor.execute(create_table_query)
print("Table created successfully.")


# Define the SQL insert query
insert_query = f"""
INSERT INTO {table_name} ({', '.join(df.columns)}) 
VALUES ({', '.join(['%s'] * len(df.columns))})
"""

# Insert each row from the DataFrame into the database
for _, row in df.iterrows():
    cursor.execute(insert_query, tuple(row))

# Commit the transaction
connection.commit()
print("Data successfully loaded into the database.")

# Close the cursor and connection
cursor.close()
connection.close()

Connected to the database successfully!
Table created successfully.
Data successfully loaded into the database.

In [37]:
import logging
import boto3
import pandas as pd
from sqlalchemy import create_engine
from botocore.exceptions import ClientError
import mysql.connector
from io import StringIO

# Configure logging
logging.basicConfig(
    filename='etl_process.log',
    filemode='w',
    level=logging.INFO,
    format='%(asctime)s - %(levelname)s - %(message)s'
)
logger = logging.getLogger(__name__)

# S3 Client Setup
s3_client = boto3.client('s3', region_name='us-east-1')

# Functions to read from S3 in different formats

def read_from_s3_csv(bucket_name, s3_key):
    """Read CSV data from S3."""
    try:
        response = s3_client.get_object(Bucket=bucket_name, Key=s3_key)
        csv_content = response['Body'].read().decode('utf-8')
        data = pd.read_csv(StringIO(csv_content))
        logger.info(f"CSV file '{s3_key}' read from bucket '{bucket_name}'.")
        return data
    except ClientError as e:
        logger.error(f"Failed to read CSV from S3: {e}")
        return None

def read_from_s3_json(bucket_name, s3_key):
    """Read JSON data from S3."""
    try:
        response = s3_client.get_object(Bucket=bucket_name, Key=s3_key)
        json_content = response['Body'].read().decode('utf-8')
        data = pd.read_json(StringIO(json_content), lines=True)
        logger.info(f"JSON file '{s3_key}' read from bucket '{bucket_name}'.")
        return data
    except ClientError as e:
        logger.error(f"Failed to read JSON from S3: {e}")
        return None

def read_from_s3_xml(bucket_name, s3_key):
    """Read XML data from S3."""
    try:
        response = s3_client.get_object(Bucket=bucket_name, Key=s3_key)
        xml_content = response['Body'].read().decode('utf-8')
        data = pd.read_xml(StringIO(xml_content))
        logger.info(f"XML file '{s3_key}' read from bucket '{bucket_name}'.")
        return data
    except ClientError as e:
        logger.error(f"Failed to read XML from S3: {e}")
        return None

# Combine data from multiple sources
bucket_name = 'project4etl'
data_csv = read_from_s3_csv(bucket_name, 'data/source1.csv')
data_json = read_from_s3_json(bucket_name, 'data/source1.json')
data_xml = read_from_s3_xml(bucket_name, 'data/source1.xml')

try:
    data_final = pd.concat([data_csv, data_json, data_xml], ignore_index=True)
    logger.info("Data combined successfully.")
except Exception as e:
    logger.error(f"Error combining data: {e}")

# Save combined DataFrame to a local CSV file
try:
    data_final.to_csv('transformed_data.csv', index=False)
    logger.info("Transformed data saved locally as 'transformed_data.csv'.")
except Exception as e:
    logger.error(f"Failed to save transformed data: {e}")

# Upload transformed data to a new S3 bucket
new_bucket_name = 'etlfinal4'
local_file = 'transformed_data.csv'
s3_key = 'transformed_data.csv'

try:
    with open(local_file, 'rb') as f:
        s3_client.upload_fileobj(f, new_bucket_name, s3_key)
    logger.info(f"{local_file} uploaded to s3://{new_bucket_name}/{s3_key}")
except ClientError as e:
    logger.error(f"Failed to upload '{local_file}' to S3: {e}")

# RDS Database Connection
db_user = 'admin'
db_password = 'Gaganch007'
db_host = 'project-4.ch6iy2q8mb95.us-east-1.rds.amazonaws.com'
db_port = '3306'
db_name = 'TEST'

# Create SQLAlchemy engine for testing connection
connection_string = f"mysql+pymysql://{db_user}:{db_password}@{db_host}:{db_port}/{db_name}"
engine = create_engine(connection_string)

try:
    with engine.connect() as connection:
        logger.info("Connection to RDS database successful.")
except Exception as e:
    logger.error(f"Error connecting to RDS database: {e}")

# Connect with mysql.connector to load data
try:
    connection = mysql.connector.connect(
        user=db_user,
        password=db_password,
        host=db_host,
        port=db_port,
        database=db_name
    )
    logger.info("Connected to the database with mysql.connector.")
except Exception as e:
    logger.error(f"Error connecting to the database: {e}")
    connection = None

# Load data into RDS
if connection and connection.is_connected():
    cursor = connection.cursor()
    table_name = 'etl4'

    # Create table if it doesn't exist
    create_table_query = f"""
    CREATE TABLE IF NOT EXISTS {table_name} (
        name VARCHAR(50),
        height FLOAT,
        weight FLOAT
    )
    """
    try:
        cursor.execute(create_table_query)
        logger.info("Table created successfully.")
    except Exception as e:
        logger.error(f"Error creating table: {e}")

    # Insert data
    insert_query = f"""
    INSERT INTO {table_name} ({', '.join(data_final.columns)}) 
    VALUES ({', '.join(['%s'] * len(data_final.columns))})
    """
    try:
        for _, row in data_final.iterrows():
            cursor.execute(insert_query, tuple(row))
        connection.commit()
        logger.info("Data loaded into RDS table successfully.")
    except Exception as e:
        logger.error(f"Error loading data into RDS: {e}")

    # Close cursor and connection
    cursor.close()
    connection.close()
    logger.info("Database connection closed.")
else:
    logger.error("Skipping data load due to failed database connection.")